# Hannukkah of Data

## Puzzle 1

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('noahs-csv/noahs-customers.csv')

In [3]:
df.shape

(11080, 6)

In [4]:
df.head()

,customerid,name,address,citystatezip,birthdate,phone
0,1001,Jack Quinn,201 E Park St,"Los Angeles, CA 91343",1960-05-14,805-287-8515
1,1002,David Powell,224C Tysens Ln,"Staten Island, NY 10306",1978-04-04,516-768-1652
2,1003,Carrie Green,1608 W 53rd Way,"Tampa, FL 33614",1969-01-21,727-209-0470
3,1004,Steven Miller,178½ E 7th St,"Manhattan, NY 10009",1953-08-17,607-941-9563
4,1005,Christine Powers,270 W 242nd St,"Bronx, NY 10463",1983-06-06,212-759-9043

In [5]:
number_dictionary = {
    'abc': 2,
    'def':3,
    'ghi':4,
    'jkl':5,
    'mno':6,
    'pqrs':7,
    'tuv':8,
    'wxyz':9
}

In [6]:
df['phone_clean'] = df.phone.str.replace('-', '')

In [7]:
df['last_name'] = df['name'].apply(lambda x: x.split()[-1].lower())

In [8]:
df['last_name'] = df['last_name'].str.split('')

In [9]:
df.head()

,customerid,name,address,citystatezip,birthdate,phone,phone_clean,last_name
0,1001,Jack Quinn,201 E Park St,"Los Angeles, CA 91343",1960-05-14,805-287-8515,8052878515,"[, q, u, i, n, n, ]"
1,1002,David Powell,224C Tysens Ln,"Staten Island, NY 10306",1978-04-04,516-768-1652,5167681652,"[, p, o, w, e, l, l, ]"
2,1003,Carrie Green,1608 W 53rd Way,"Tampa, FL 33614",1969-01-21,727-209-0470,7272090470,"[, g, r, e, e, n, ]"
3,1004,Steven Miller,178½ E 7th St,"Manhattan, NY 10009",1953-08-17,607-941-9563,6079419563,"[, m, i, l, l, e, r, ]"
4,1005,Christine Powers,270 W 242nd St,"Bronx, NY 10463",1983-06-06,212-759-9043,2127599043,"[, p, o, w, e, r, s, ]"

In [10]:
df.head(6)

,customerid,name,address,citystatezip,birthdate,phone,phone_clean,last_name
0,1001,Jack Quinn,201 E Park St,"Los Angeles, CA 91343",1960-05-14,805-287-8515,8052878515,"[, q, u, i, n, n, ]"
1,1002,David Powell,224C Tysens Ln,"Staten Island, NY 10306",1978-04-04,516-768-1652,5167681652,"[, p, o, w, e, l, l, ]"
2,1003,Carrie Green,1608 W 53rd Way,"Tampa, FL 33614",1969-01-21,727-209-0470,7272090470,"[, g, r, e, e, n, ]"
3,1004,Steven Miller,178½ E 7th St,"Manhattan, NY 10009",1953-08-17,607-941-9563,6079419563,"[, m, i, l, l, e, r, ]"
4,1005,Christine Powers,270 W 242nd St,"Bronx, NY 10463",1983-06-06,212-759-9043,2127599043,"[, p, o, w, e, r, s, ]"
5,1006,Amanda Ramirez,183-48 Camden Ave,"Saint Albans, NY 11412",1962-07-08,914-421-3167,9144213167,"[, r, a, m, i, r, e, z, ]"

In [11]:
number_list = []
for surname in df.last_name:
    name_values = []
    for char in surname:
        for key in number_dictionary:
            if char == '':
                pass
            elif char in key:
                name_values.append(number_dictionary[key])
                
    number_list.append(name_values)

In [13]:
len(number_list)

11080

In [14]:
df.head()

,customerid,name,address,citystatezip,birthdate,phone,phone_clean,last_name
0,1001,Jack Quinn,201 E Park St,"Los Angeles, CA 91343",1960-05-14,805-287-8515,8052878515,"[, q, u, i, n, n, ]"
1,1002,David Powell,224C Tysens Ln,"Staten Island, NY 10306",1978-04-04,516-768-1652,5167681652,"[, p, o, w, e, l, l, ]"
2,1003,Carrie Green,1608 W 53rd Way,"Tampa, FL 33614",1969-01-21,727-209-0470,7272090470,"[, g, r, e, e, n, ]"
3,1004,Steven Miller,178½ E 7th St,"Manhattan, NY 10009",1953-08-17,607-941-9563,6079419563,"[, m, i, l, l, e, r, ]"
4,1005,Christine Powers,270 W 242nd St,"Bronx, NY 10463",1983-06-06,212-759-9043,2127599043,"[, p, o, w, e, r, s, ]"

In [15]:
num_join_list = []
for phone_num in number_list:
    if phone_num == '':
        pass
    else:
       num_join_list.append(''.join(map(str, phone_num)))

In [19]:
detective_name

(array([2187]),)

In [20]:
df.iloc[2187]

customerid                                     3188
name                                 Sam Guttenberg
address                               221 Banker St
citystatezip                     Brooklyn, NY 11222
birthdate                                1998-05-30
phone                                  488-836-2374
phone_clean                              4888362374
last_name        [, g, u, t, t, e, n, b, e, r, g, ]
phone_by_name                            4888362374
Name: 2187, dtype: object